<a href="https://colab.research.google.com/github/bydebby/python/blob/main/Pandas_Basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Basic in A Notebook

In [ ]:
#Release: 1.2109.1901

In [ ]:
import pandas as pd
import numpy as np

#Series

Pandas series adalah kumpulan object satu dimensi yang mirip dengan array

##Creating Series

Deklarasi pandas series menggunakan list

In [ ]:
s = pd.Series([1, 'Hello', 3.14, 'World!', True])
s

0         1
1     Hello
2      3.14
3    World!
4      True
dtype: object

Deklarasi pandas series menggunakan dictionary

In [ ]:
f = {"apples": 10, "bananas": 20, "cherries": 50, "pears": 30}
fs = pd.Series(f)
fs

apples      10
bananas     20
cherries    50
pears       30
dtype: int64

##Series Operation

In [ ]:
print(fs['bananas'])      #accessing item

20

In [ ]:
print(fs[:2])             #accessing items with index slicing

apples     10
bananas    20
dtype: int64

In [ ]:
fs['cherries']+=5         #updating an item
print(fs)

apples      10
bananas     20
cherries    55
pears       30
dtype: int64

In [ ]:
print('grapes' in fs)    #check membership
print('pears' in fs)     #check membership

False
True

In [ ]:
print(fs/10)              #math operation

apples      1.0
bananas     2.0
cherries    5.5
pears       3.0
dtype: float64

#DataFrames

Pandas DataFrame adalah kumpulan object berbentuk tabular yang memiliki struktur kolom dan baris, mirip pada database

##Creating DataFrames

###Create from series

In [ ]:
# Dataframe from Series
fruits = {"apples": 10, "bananas": 20, "cherries": 50, "pears": 30}
quantity = pd.Series(fruits)

prices = {"apples": 1000, "bananas": 500, "cherries": 750, "pears": 900}
price = pd.Series(prices)

df = pd.DataFrame({'quantity':quantity, 'price':price})

In [ ]:
# tampilkan df

###Create from dictionary

In [ ]:
#Dataframe from dictionary
f = {'name':["apples", "bananas", "cherries", "pears", "pears"],
    'quantity':[20, 20, 50, 30, 40],
    'price':[1000,500,750,900,950]}
    
df = pd.DataFrame(f)

In [ ]:
# tampilkan df

###Create from csv file

Fungsi **read_csv** dapat digunakan untuk membaca file csv ke dalam pandas dataframe

In [ ]:
! head sample_data/california_housing_train.csv

"longitude","latitude","housing_median_age","total_rooms","total_bedrooms","population","households","median_income","median_house_value"
-114.310000,34.190000,15.000000,5612.000000,1283.000000,1015.000000,472.000000,1.493600,66900.000000
-114.470000,34.400000,19.000000,7650.000000,1901.000000,1129.000000,463.000000,1.820000,80100.000000
-114.560000,33.690000,17.000000,720.000000,174.000000,333.000000,117.000000,1.650900,85700.000000
-114.570000,33.640000,14.000000,1501.000000,337.000000,515.000000,226.000000,3.191700,73400.000000
-114.570000,33.570000,20.000000,1454.000000,326.000000,624.000000,262.000000,1.925000,65500.000000
-114.580000,33.630000,29.000000,1387.000000,236.000000,671.000000,239.000000,3.343800,74000.000000
-114.580000,33.610000,25.000000,2907.000000,680.000000,1841.000000,633.000000,2.676800,82400.000000
-114.590000,34.830000,41.000000,812.000000,168.000000,375.000000,158.000000,1.708300,48500.000000
-114.590000,33.610000,34.000000,4789.000000,1175.000000,3134.000000,1056.000000,2.178200,58400.000000

In [ ]:
# load the california housing csv file from sample_data
df_housing = pd.read_csv('sample_data/california_housing_train.csv')

In [ ]:
# tampilkan df_housing
df_housing

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

###Create from JSON file

Fungsi **read_json** dapat digunakan untuk membaca file csv ke dalam pandas dataframe

In [ ]:
! head sample_data/anscombe.json

[
  {"Series":"I", "X":10.0, "Y":8.04},
  {"Series":"I", "X":8.0, "Y":6.95},
  {"Series":"I", "X":13.0, "Y":7.58},
  {"Series":"I", "X":9.0, "Y":8.81},
  {"Series":"I", "X":11.0, "Y":8.33},
  {"Series":"I", "X":14.0, "Y":9.96},
  {"Series":"I", "X":6.0, "Y":7.24},
  {"Series":"I", "X":4.0, "Y":4.26},
  {"Series":"I", "X":12.0, "Y":10.84},

In [ ]:
# load Anscombe's quartet data from sample_data
df_anscombe = pd.read_json('sample_data/anscombe.json')

In [ ]:
# tampilkan df_anscombe
df_anscombe

   Series   X      Y
0       I  10   8.04
1       I   8   6.95
2       I  13   7.58
3       I   9   8.81
4       I  11   8.33
5       I  14   9.96
6       I   6   7.24
7       I   4   4.26
8       I  12  10.84
9       I   7   4.81
10      I   5   5.68
11     II  10   9.14
12     II   8   8.14
13     II  13   8.74
14     II   9   8.77
15     II  11   9.26
16     II  14   8.10
17     II   6   6.13
18     II   4   3.10
19     II  12   9.13
20     II   7   7.26
21     II   5   4.74
22    III  10   7.46
23    III   8   6.77
24    III  13  12.74
25    III   9   7.11
26    III  11   7.81
27    III  14   8.84
28    III   6   6.08
29    III   4   5.39
30    III  12   8.15
31    III   7   6.42
32    III   5   5.73
33     IV   8   6.58
34     IV   8   5.76
35     IV   8   7.71
36     IV   8   8.84
37     IV   8   8.47
38     IV   8   7.04
39     IV   8   5.25
40     IV  19  12.50
41     IV   8   5.56
42     IV   8   7.91
43     IV   8   6.89

##Accessing DataFrame

###DataFrame quick checking

some useful commands to quick check a dataframe : `info(), head(), tail(), sample(), describe()`

In [ ]:
# tampilkan struktur df menggunakan fungsi info
df_housing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [ ]:
# tampilkan 10 record pertama dari df menggunakan fungsi head
df_housing.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [ ]:
# tampilkan 10 record terakhir df menggunakan fungsi tail
df_housing.tail(10)

       longitude  latitude  ...  median_income  median_house_value
16990    -124.22     41.73  ...         1.7038             78300.0
16991    -124.23     41.75  ...         2.4805             73200.0
16992    -124.23     40.81  ...         3.3462             50800.0
16993    -124.23     40.54  ...         3.0806            106700.0
16994    -124.25     40.28  ...         1.9417             76100.0
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[10 rows x 9 columns]

In [ ]:
# tampilkan sample records secara acak menggunakan fungsi sample
df_housing.sample(5)

       longitude  latitude  ...  median_income  median_house_value
12010    -121.40     38.61  ...         1.9908            118800.0
9461     -119.27     36.34  ...         3.5296             83700.0
15310    -122.28     37.78  ...         2.5139            219000.0
6168     -118.24     34.16  ...         3.3333            374300.0
14581    -122.16     37.74  ...         3.4844            129500.0

[5 rows x 9 columns]

In [ ]:
# tampilkan nilai statistik df dengan fungsi describe
df_housing.describe()

          longitude      latitude  ...  median_income  median_house_value
count  17000.000000  17000.000000  ...   17000.000000        17000.000000
mean    -119.562108     35.625225  ...       3.883578       207300.912353
std        2.005166      2.137340  ...       1.908157       115983.764387
min     -124.350000     32.540000  ...       0.499900        14999.000000
25%     -121.790000     33.930000  ...       2.566375       119400.000000
50%     -118.490000     34.250000  ...       3.544600       180400.000000
75%     -118.000000     37.720000  ...       4.767000       265000.000000
max     -114.310000     41.950000  ...      15.000100       500001.000000

[8 rows x 9 columns]

In [ ]:
# untuk memudahkan pembacaan dapat menambahkan fungsi transpose
df_housing.describe().transpose()

                      count           mean  ...         75%          max
longitude           17000.0    -119.562108  ...    -118.000    -114.3100
latitude            17000.0      35.625225  ...      37.720      41.9500
housing_median_age  17000.0      28.589353  ...      37.000      52.0000
total_rooms         17000.0    2643.664412  ...    3151.250   37937.0000
total_bedrooms      17000.0     539.410824  ...     648.250    6445.0000
population          17000.0    1429.573941  ...    1721.000   35682.0000
households          17000.0     501.221941  ...     605.250    6082.0000
median_income       17000.0       3.883578  ...       4.767      15.0001
median_house_value  17000.0  207300.912353  ...  265000.000  500001.0000

[9 rows x 8 columns]

###Selecting rows or columns

In [ ]:
# mengakses data menggunakan index --> [idx:pos]
df_housing[2:4]

   longitude  latitude  ...  median_income  median_house_value
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0

[2 rows x 9 columns]

In [ ]:
# kolom dapat dianggap sebagai sebuah atribut
df.price

0    1000
1     500
2     750
3     900
4     950
Name: price, dtype: int64

In [ ]:
df_housing.median_income

0        1.4936
1        1.8200
2        1.6509
3        3.1917
4        1.9250
          ...
16995    2.3571
16996    2.5179
16997    3.0313
16998    1.9797
16999    3.0147
Name: median_income, Length: 17000, dtype: float64

In [ ]:
# menampilkan kolom berdasarkan nama
df[["price"]]   #accessing column by name

   price
0   1000
1    500
2    750
3    900
4    950

In [ ]:
df_housing[["median_house_value"]]

       median_house_value
0                 66900.0
1                 80100.0
2                 85700.0
3                 73400.0
4                 65500.0
...                   ...
16995            111400.0
16996             79000.0
16997            103600.0
16998             85800.0
16999             94600.0

[17000 rows x 1 columns]

In [ ]:
# menampilkan lebih dari satu kolom
df[['name','price']]

       name  price
0    apples   1000
1   bananas    500
2  cherries    750
3     pears    900
4     pears    950

In [ ]:
df_housing[["median_house_value","total_rooms"]]

       median_house_value  total_rooms
0                 66900.0       5612.0
1                 80100.0       7650.0
2                 85700.0        720.0
3                 73400.0       1501.0
4                 65500.0       1454.0
...                   ...          ...
16995            111400.0       2217.0
16996             79000.0       2349.0
16997            103600.0       2677.0
16998             85800.0       2672.0
16999             94600.0       1820.0

[17000 rows x 2 columns]

In [ ]:
column_name = ["median_house_value","total_rooms"]

df_housing[column_name].head()

   median_house_value  total_rooms
0             66900.0       5612.0
1             80100.0       7650.0
2             85700.0        720.0
3             73400.0       1501.0
4             65500.0       1454.0

In [ ]:
df_housing[df_housing['total_rooms'] > 100].head()     #filtering/select rows

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [ ]:
# filter untuk nama = 'pears' atau price > 900
df[(df.name == 'pears') | (df.price > 900)]

     name  quantity  price
0  apples        20   1000
3   pears        30    900
4   pears        40    950

In [ ]:
# filter untuk price antara 900 dan 1000
df[(df.price > 900) & (df.price < 1000)]

    name  quantity  price
4  pears        40    950

In [ ]:
# tampilkan data dengan kolom name dan price yang memiliki harga > 750

###Select unique values

In [ ]:
df

       name  quantity  price
0    apples        20   1000
1   bananas        20    500
2  cherries        50    750
3     pears        30    900
4     pears        40    950

In [ ]:
# menampilkan nilai unik dari nama
df['name'].unique()

array(['apples', 'bananas', 'cherries', 'pears'], dtype=object)

###Sorting rows

In [ ]:
df.sort_values("quantity")

       name  quantity  price
0    apples        20   1000
1   bananas        20    500
3     pears        30    900
4     pears        40    950
2  cherries        50    750

In [ ]:
# mengurutkan dari yang terbesar dengan menset parameter ascending = False
# order by quantity DESC
df.sort_values("quantity", ascending = False)

       name  quantity  price
2  cherries        50    750
4     pears        40    950
3     pears        30    900
0    apples        20   1000
1   bananas        20    500

In [ ]:
df.sort_values(["quantity","price"]) #sort by multiple columns value

       name  quantity  price
1   bananas        20    500
0    apples        20   1000
3     pears        30    900
4     pears        40    950
2  cherries        50    750

In [ ]:
df.sort_values(["quantity","price"], ascending=[1, 0])

       name  quantity  price
0    apples        20   1000
1   bananas        20    500
3     pears        30    900
4     pears        40    950
2  cherries        50    750

##Updating a DataFrame

###Adding rows

In [ ]:
#append a row from dictionary

new_rec = {'name': "grapes", 
        'quantity': 30,
        'price':1200}
df1 = df.append(new_rec, ignore_index=True)
df1

       name  quantity  price
0    apples        20   1000
1   bananas        20    500
2  cherries        50    750
3     pears        30    900
4     pears        40    950
5    grapes        30   1200

In [ ]:
new_rec = {'name': "pineapple", 
        'quantity': 30}
df1 = df.append(new_rec, ignore_index=True)
df1

        name  quantity   price
0     apples        20  1000.0
1    bananas        20   500.0
2   cherries        50   750.0
3      pears        30   900.0
4      pears        40   950.0
5  pineapple        30     NaN

Append multiple rows --> combine dataframes

In [ ]:
new_rec = {'name':["apples", "grapes", "oranges"],
        'quantity':[25, 30, 20],
        'price':[800,1200,700]}

dfnew = pd.DataFrame(new_rec,index=[6, 7, 8])

In [ ]:
dfnew

      name  quantity  price
6   apples        25    800
7   grapes        30   1200
8  oranges        20    700

In [ ]:
df1

        name  quantity   price
0     apples        20  1000.0
1    bananas        20   500.0
2   cherries        50   750.0
3      pears        30   900.0
4      pears        40   950.0
5  pineapple        30     NaN

In [ ]:
df2 = df1.append(dfnew)
df2

        name  quantity   price
0     apples        20  1000.0
1    bananas        20   500.0
2   cherries        50   750.0
3      pears        30   900.0
4      pears        40   950.0
5  pineapple        30     NaN
6     apples        25   800.0
7     grapes        30  1200.0
8    oranges        20   700.0

###Adding columns

In [ ]:
df2['total'] = df2['price'] * df2['quantity']
df2

        name  quantity   price    total
0     apples        20  1000.0  20000.0
1    bananas        20   500.0  10000.0
2   cherries        50   750.0  37500.0
3      pears        30   900.0  27000.0
4      pears        40   950.0  38000.0
5  pineapple        30     NaN      NaN
6     apples        25   800.0  20000.0
7     grapes        30  1200.0  36000.0
8    oranges        20   700.0  14000.0

###Deleting columns or rows

**Deleting a column**

In [ ]:
df2.drop('total', axis = 1) #set the parameter axis = 1

        name  quantity   price
0     apples        20  1000.0
1    bananas        20   500.0
2   cherries        50   750.0
3      pears        30   900.0
4      pears        40   950.0
5  pineapple        30     NaN
6     apples        25   800.0
7     grapes        30  1200.0
8    oranges        20   700.0

In [ ]:
df2

        name  quantity   price    total
0     apples        20  1000.0  20000.0
1    bananas        20   500.0  10000.0
2   cherries        50   750.0  37500.0
3      pears        30   900.0  27000.0
4      pears        40   950.0  38000.0
5  pineapple        30     NaN      NaN
6     apples        25   800.0  20000.0
7     grapes        30  1200.0  36000.0
8    oranges        20   700.0  14000.0

To delete column in the original dataframe, set `inplace = True`

In [ ]:
df2.drop('total', axis = 1, inplace = True) #set the parameter axis = 1
df2

        name  quantity   price
0     apples        20  1000.0
1    bananas        20   500.0
2   cherries        50   750.0
3      pears        30   900.0
4      pears        40   950.0
5  pineapple        30     NaN
6     apples        25   800.0
7     grapes        30  1200.0
8    oranges        20   700.0

Deleting a row by index

In [ ]:
df2.drop(4)

        name  quantity   price
0     apples        20  1000.0
1    bananas        20   500.0
2   cherries        50   750.0
3      pears        30   900.0
5  pineapple        30     NaN
6     apples        25   800.0
7     grapes        30  1200.0
8    oranges        20   700.0

In [ ]:
df2 = df2.drop(4)

In [ ]:
df2

        name  quantity   price
0     apples        20  1000.0
1    bananas        20   500.0
2   cherries        50   750.0
3      pears        30   900.0
5  pineapple        30     NaN
6     apples        25   800.0
7     grapes        30  1200.0
8    oranges        20   700.0

Deleting rows by condition

In [ ]:
df2.drop(df2[df2.quantity < 30].index)

        name  quantity   price
2   cherries        50   750.0
3      pears        30   900.0
5  pineapple        30     NaN
7     grapes        30  1200.0

###Updating a column

In [ ]:
df2['quantity'] = df2['quantity'] * 1000
df2

        name  quantity   price
0     apples     20000  1000.0
1    bananas     20000   500.0
2   cherries     50000   750.0
3      pears     30000   900.0
5  pineapple     30000     NaN
6     apples     25000   800.0
7     grapes     30000  1200.0
8    oranges     20000   700.0

###Updating rows

In [ ]:
#update rows based on some conditions
df2.loc[df2['name'] == 'pears', 'quantity'] = 60000 

df2

        name  quantity   price
0     apples     20000  1000.0
1    bananas     20000   500.0
2   cherries     50000   750.0
3      pears     60000   900.0
5  pineapple     30000     NaN
6     apples     25000   800.0
7     grapes     30000  1200.0
8    oranges     20000   700.0

##Combining DataFrame - Join by columns

In [ ]:
colors = pd.DataFrame({'name':["apples", "bananas", "pears", "grapes", "cherries", "plum"], 
                       'color':['red', 'yellow', 'green', 'purple', 'red', 'purple']})
colors

       name   color
0    apples     red
1   bananas  yellow
2     pears   green
3    grapes  purple
4  cherries     red
5      plum  purple

In [ ]:
pd.merge(df2, colors, on='name', how='inner')

       name  quantity   price   color
0    apples     20000  1000.0     red
1    apples     25000   800.0     red
2   bananas     20000   500.0  yellow
3  cherries     50000   750.0     red
4     pears     60000   900.0   green
5    grapes     30000  1200.0  purple

In [ ]:
df3 = pd.merge(df2, colors, on='name', how='outer')
df3

        name  quantity   price   color
0     apples   20000.0  1000.0     red
1     apples   25000.0   800.0     red
2    bananas   20000.0   500.0  yellow
3   cherries   50000.0   750.0     red
4      pears   60000.0   900.0   green
5  pineapple   30000.0     NaN     NaN
6     grapes   30000.0  1200.0  purple
7    oranges   20000.0   700.0     NaN
8       plum       NaN     NaN  purple

# Revision History

Release: 1.2109.1901

* Code cleanup